#include <iostream>
using namespace std;



int main()
{
	setlocale(LC_ALL, "Russian");

	double x, y;

	cout << "Введите x: ";
	cin >> x;

	cout << "Введите y: ";
	cin >> y;

	cout << "Координата точки: " << "(" << x << ";" << y << ")" << endl;

	if ((- 3 * x + 3 * y == 0) && (y == -(x + 2) * (x + 2) + 2)) {
		cout << "Точка пересечения параболы и прямой" << endl;
	}
	else if ((y == -(x + 2) * (x + 2) + 2) && ((x + 3) * (x + 3) + (y + 3) * (y + 3) == 9)){
		cout << "Точка пересечения параболы и окружности" << endl;
	}
	else if ((-3 * x + 3 * y == 0) && ((x + 3) * (x + 3) + (y + 3) * (y + 3) == 9)) {
		cout << "Точка пересечения прямой и окружности" << endl;

	}
	else if (-3 * x + 3 * y == 0 && (x + 3) * (x + 3) + (y + 3) * (y + 3) != 9 && y != -(x + 2) * (x + 2) + 2) {
		cout << "Точка принадлежит графику прямой" << endl;
	}
	else if (-3 * x + 3 * y != 0 && (x + 3) * (x + 3) + (y + 3) * (y + 3) != 9 && y == -(x + 2) * (x + 2) + 2) {
		cout << "Точка принадлежит графику параболы" << endl;
	}
	else if (-3 * x + 3 * y != 0 && (x + 3) * (x + 3) + (y + 3) * (y + 3) == 9 && y != -(x + 2) * (x + 2) + 2) {
		cout << "Точка принадлежит графику окружности" << endl;
	}
	else if (y > -(x + 2) * (x + 2) + 2 && y > 0 && x < 0) {
		cout << "Точка принадлежит области 1" << endl;
	}
	else if (y < -(x + 2) * (x + 2) + 2 && y > 0 && x < 0) {
		cout << "Точка принадлежит области 2" << endl;
	} 
	else if (y > x && (x + 3) * (x + 3) + (y + 3) * (y + 3) > 9 && y > -(x + 2) * (x + 2) + 2 && x < -3 && y < 0) {
		cout << "Точка принадлежит области 3" << endl;
	}
	else if (y > x && (x + 3) * (x + 3) + (y + 3) * (y + 3) < 9 && y > -(x + 2) * (x + 2) + 2) {
		cout << "Точка принадлежит области 4" << endl;
	}
	else if (y > x && (x + 3) * (x + 3) + (y + 3) * (y + 3) < 9 && y < -(x + 2) * (x + 2) + 2) {
		cout << "Точка принадлежит области 5" << endl;
	}
	else if (y > x && (x + 3) * (x + 3) + (y + 3) * (y + 3) > 9 && y < -(x + 2) * (x + 2) + 2 && x < 0 && y < 0) {
		cout << "Точка принадлежит области 6" << endl;
	}
	else if (y > x && y > -(x + 2) * (x + 2) + 2 && x < 0 && y < 0) {
		cout << "Точка принадлежит области 7" << endl;
	}
	else if (y < x && y > -(x + 2) * (x + 2) + 2 && (x + 3) * (x + 3) + (y + 3) * (y + 3) < 9 && x < -3) {
		cout << "Точка принадлежит области 8" << endl;
	}
	else if (y < x && y > -(x + 2) * (x + 2) + 2 && (x + 3) * (x + 3) + (y + 3) * (y + 3) > 9 && x < -3) {
		cout << "Точка принадлежит области 9" << endl;
	}
	else if (y < x && y < -(x + 2) * (x + 2) + 2 && (x + 3) * (x + 3) + (y + 3) * (y + 3) < 9) {
		cout << "Точка принадлежит области 10" << endl;
	}
	else if (y < x && y < -(x + 2) * (x + 2) + 2 && (x + 3) * (x + 3) + (y + 3) * (y + 3) > 9 && x < 0 && y > -3) {
		cout << "Точка принадлежит области 11" << endl;
	}
	else if (y < x && y > -(x + 2) * (x + 2) + 2 && x < 0 && y < 0) {
		cout << "Точка принадлежит области 12" << endl;
	}
	else if (y < x && y < -(x + 2) * (x + 2) + 2 && (x + 3) * (x + 3) + (y + 3) * (y + 3) > 9 && x < 0 && y < -3) {
		cout << "Точка принадлежит области 13" << endl;
	}
	else if (y < -(x + 2) * (x + 2) + 2 && x > 0 && y < 0) {
		cout << "Точка принадлежит области 14" << endl;
	}
	else if (y > -(x + 2) * (x + 2) + 2 && x > 0 && y < 0) {
		cout << "Точка принадлежит области 15" << endl;
	}
	else if (y < x && x > 0 && y > 0) {
		cout << "Точка принадлежит области 16" << endl;
	}
	else if (y > x && x > 0 && y > 0) {
		cout << "Точка принадлежит области 17" << endl;
	} 
	else if (x == 0 && y == 0) {
		cout << "Точка является началом координат" << endl;
	}
	else if (x == 0) {
		cout << "Точка принадлежит оси Oy" << endl;
	}
	else {
		cout << "Точка принадлежит оси Ox" << endl;
	}
	system("pause");
	return 0;
}
